In [2]:
import numpy as np
import pandas as pd
df1=pd.read_csv(r"C:\Users\harshit\Downloads\data set\cast.csv")
df1.head(10)

,title,year,name,type,character,n
0,Suuri illusioni,1985,Homo $,actor,Guests,22.0
1,Gangsta Rap: The Glockumentary,2007,Too $hort,actor,Himself,NaN
2,Menace II Society,1993,Too $hort,actor,Lew-Loc,27.0
3,Porndogs: The Adventures of Sadie,2009,Too $hort,actor,Bosco,3.0
4,Stop Pepper Palmer,2014,Too $hort,actor,Himself,NaN
5,Townbiz,2010,Too $hort,actor,Himself,NaN
6,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
7,Desire (III),2014,Syaiful 'Ariffin,actor,Actor Playing Eteocles from 'Antigone',NaN
8,When the Man Went South,2014,Taipaleti 'Atu'ake,actor,Two Palms - Ua'i Paame,8.0
9,Little Angel (Angelita),2015,Michael 'babeepower' Viera,actor,Chico,9.0

In [2]:
DF1=df1.iloc[:,:2]
DF1.head()

                               title  year
0                    Suuri illusioni  1985
1     Gangsta Rap: The Glockumentary  2007
2                  Menace II Society  1993
3  Porndogs: The Adventures of Sadie  2009
4                 Stop Pepper Palmer  2014

In [3]:
# Q. 1  gives total no. of movies.

df2=df1.iloc[:,:2].nunique()
df2

title    159488
year        120
dtype: int64

In [4]:
# Q. 2   gives the two earliest movies in list.

df3=df1.iloc[:,:2]
df_3=df3.sort_values(by=['year']).drop_duplicates()
df_3.head(2)

                           title  year
511376                Miss Jerry  1894
978078  Jeffries-Sharkey Contest  1899

In [5]:
# Q. 3   gives the total no. of 'Hamlet' movie.
 
df4=df1.iloc[:,:1]
df4[df4.title=='Hamlet'].title.value_counts()

Hamlet    299
Name: title, dtype: int64

In [6]:
# Q. 4    gives the total no. of 'North by Northwest' movie.

df4[df4.title=='North by Northwest'].title.value_counts()

North by Northwest    111
Name: title, dtype: int64

In [7]:
# Q. 5   gives the year in which first hamlet movie was released.

df5=DF1[DF1.title=='Hamlet'].year.unique()
df5.min()

1910

In [8]:
# Q. 6     gives list of all the 'treasure island' movie from earliest to recent

df6=DF1[DF1.title=='Treasure Island'].year.value_counts()
df6.sort_index()

1918    13
1920    12
1934    55
1950    34
1972    25
1973     9
1985    15
1999    24
Name: year, dtype: int64

In [9]:
#  Q 3 & 5. another way
df7=DF1[DF1.title=='Hamlet'].year.value_counts()
df7.sort_values()

1910     1
1954     1
1987     3
2015     6
1911     6
1973     8
1921     9
1976    11
2011    12
2009    17
1913    21
1969    24
1948    25
1990    29
1964    33
2000    38
1996    55
Name: year, dtype: int64

In [10]:
# Q. 7   gives total no. of movies released in 1950.

df8=DF1[DF1.year==1950].title.value_counts()
df8.sum()

21414

In [22]:
# Q. 7   another way : gives total no. of movies released in 1950.

df9=DF1[DF1.year==1950].year.value_counts()
df9

1950    21414
Name: year, dtype: int64

In [23]:
# Q. 8  gives the total no. of movies released in 1960.

df10=DF1[DF1.year==1960].year.value_counts()
df10

1960    17163
Name: year, dtype: int64

In [24]:
# Q. 10  gives that years in which 'batman' movie was released.

df11=DF1[DF1.title=='Batman'].year.drop_duplicates()
df11

86823     1943
103458    1989
Name: year, dtype: int64

In [25]:
# Q 10.  gives those years in which 'batman' movie was released alongwith the no. of movies..  (another way)

df12=DF1[DF1.title=='Batman'].year.value_counts()
df12.sort_index()

1943    52
1989    66
Name: year, dtype: int64

In [26]:
# Q 11. gives the total no. of roles in 'inception' movie.

df13=df1[df1.title=='Inception'].n
df13.dropna()
df13.sum()

1326.0

In [27]:
# Q 11.  total no. of roles in inception movie.

df14=df1[df1.title=='Inception'].character
df14.drop_duplicates().value_counts().sum()

51

In [28]:
# Q 13. how many roles in inception receive an "n" value.

df15=df1[df1.title=='Inception'].n
df15.dropna().value_counts().sum()

51

In [29]:
# Q 14. cast of 'north by northwest' movie with their 'n'  value            (incomplete)

df16=df1[df1.title=='North by Northwest'].n
df16.dropna().sort_values()

773496      1.0
3084579     2.0
1292652     3.0
2776446     4.0
315343      5.0
2685171     6.0
1504777     7.0
1130557     8.0
2167754     9.0
1607029    10.0
590702     11.0
2033529    12.0
411247     13.0
1339004    14.0
180985     15.0
1228229    16.0
Name: n, dtype: float64

In [30]:
# Q 12. how many roles in 'inception' are not ranked by 'n' value

df17=df1[df1.title=='Inception'].n.value_counts(dropna=False)
df17.head(1)

NaN    21
Name: n, dtype: int64

In [31]:
# Q 15. cast of 1972 sleuth film..

df18=df1[(df1['title']=='Sleuth') & (df1['year']==1972)].character
df18.value_counts()

Marguerite Wyke               1
Detective Sergeant Tarrant    1
Andrew Wyke                   1
Police Constable Higgs        1
Inspector Doppler             1
Milo Tindle                   1
Name: character, dtype: int64

In [3]:
# Q 16 cast of 2007 sleuth film..

df19=df1[(df1['title']=='Sleuth') & (df1['year']==2007)].character
df19

228757     Other Man on T.V.
288503                Andrew
330751     Inspector Doppler
1147041                 Milo
1602268          Man on T.V.
2406761      Marguerite Wyke
2958823               Maggie
Name: character, dtype: object

In [11]:
df20=df1[(df1['title']=='Hemlet') & (df1['year']==1921)].sort_values("type")
df20

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

In [5]:
df21=df1[(df1['name']=='Branagh') & (df1['year']==1996)].n
df21

Series([], Name: n, dtype: float64)

In [14]:
df22=df1[df1.title=='Hemlet'].character
df22

Series([], Name: character, dtype: object)

In [17]:
# Q 20. how many people played 'ophelia' role.

df23=df1[df1.character=='Ophelia'].n
df23.dropna().sum()

555.0

In [20]:
# Q 21. how many peoples played 'the dude' role.

df24=df1[df1.character=='The Dude'].n
df24.dropna().sum()

151.0

In [23]:
# Q 22. how many people played "the stranger" role.

df25=df1[df1.character=='The Stranger'].n
df25.dropna().sum()

849.0

In [28]:
# Q 23. roles played by sidney poitier.

df26=df1[df1.character=='Sidney Poitier'].title
df26.value_counts()

Brando Unauthorized    1
Name: title, dtype: int64

In [33]:
# Q 24. roles played by judi dench.

df27=df1[df1.character=='Judi Dench'].n
df27.sum()

0.0

In [52]:
# Q 25. supporting roles played by cary grant.

df28=df1[(df1['character']=='Cary Grant') & (df1['n']==2)].name
df28

836825    Kenneth Harlan
Name: name, dtype: object

In [53]:
df29=df1[(df1['character']=='Cary Grant') & (df1['n']==1)].year
df29

Series([], Name: year, dtype: int64)

In [65]:
# Q 27. roles available for actors in 1950.

df30=df1[(df1['year']==1950) & (df1['type']=='actor')].name.nunique()
df30

6962

In [69]:
# Q 28. roles available for actresses in 1950.

df31=df1[(df1['year']==1950) & (df1['type']=='actress')].name.nunique()
df31

3260

In [3]:
# 3 years in 1930s showing the most no. of movies.

a = df1[(df1['year']>=1930) & (df1['year']<1940)].sort_values(by=['year'])
grp=a.groupby('year')
grp['year'].value_counts().sort_values(ascending=False)

year  year
1937  1937    27022
1936  1936    25381
1938  1938    24755
1939  1939    24008
1935  1935    23682
1934  1934    20251
1933  1933    15099
1932  1932    14552
1931  1931    11575
1930  1930     9540
Name: year, dtype: int64

In [10]:
# Q 9(xtra). How many individual movies were made from 1950 through 1959?

b=df1[(df1['year']>=1950) & (df1['year']<1960)].sort_values(by=['year'])  # gives whole data in ascending order of years from 1950 to 1959.
grp=b.groupby('year').title.value_counts()   # groups data year wise and counts the no. of indvdl movies.
grp

year  title
1950  Gone to Earth                      294
      Kill the Umpire                    135
      Riding High                        113
      When Willie Comes Marching Home    105
      Black Hand                         103
      The Petty Girl                      97
      Copper Canyon                       95
      Let's Dance                         92
      The Flame and the Arrow             92
      Three Came Home                     88
      Annie Get Your Gun                  87
      Key to the City                     87
      Father of the Bride                 86
      A Life of Her Own                   84
      No Way Out                          80
      Mister 880                          79
      Love That Brute                     78
      A Woman of Distinction              76
      My Blue Heaven                      76
      Please Believe Me                   76
      The Yellow Cab Man                  76
      Emergency Wedding                   75
      The Great Jewel Robber              73
      Between Midnight and Dawn           72
      Seven Days to Noon                  72
      The Asphalt Jungle                  72
      Where Danger Lives                  72
      Mrs. O'Malley and Mr. Malone        70
      Wabash Avenue                       70
      Sunset Blvd.                        69
                                        ...
1959  Cilali Ibo casuslar arasinda         1
      Cilali Ibo yildizlar arasinda        1
      Da xia qing sha an                   1
      Dona Xepa                            1
      Faisla                               1
      Flor de canela                       1
      Fosforlu Cevriye                     1
      Ge mi xiao jie                       1
      He nacido en Buenos Aires            1
      I Lili kai o mourdaris               1
      Jagajyothi Basaveshwara              1
      Jin tian wo xiu xi                   1
      Kirik plak                           1
      Koel                                 1
      Lin jia pu zi                        1
      Marcelino                            1
      Nacida para amar                     1
      Nash korespondent                    1
      Pasos de angustia                    1
      Rancho Texas                         1
      Rosa Rossini                         1
      Salangi gagijeone                    1
      Samanyolu                            1
      Shi xiong di                         1
      Sudba pojeta                         1
      Tetsuwan toshu inao monogatari       1
      The Lost Class of '59                1
      Unpaid Debt                          1
      Veter                                1
      Vrata ostaju otvorena                1
Name: title, Length: 9717, dtype: int64

In [15]:
# Q 9. How many total movies were made from 1950 through 1959?

b=df1[(df1['year']>=1950) & (df1['year']<1960)].sort_values(by=['year'])  # gives the whole data year wise in separated rows.
grp=b.groupby('year')     # groups data into groups of year, (gives dict having year as a key and list of index value as value)
grp['year'].value_counts()   # counts the no. of entries in each grp of year.

year  year
1950  1950    21414
1951  1951    22388
1952  1952    22020
1953  1953    21322
1954  1954    18604
1955  1955    19120
1956  1956    20685
1957  1957    19908
1958  1958    19062
1959  1959    17397
Name: year, dtype: int64